tests/Payloads/subscription_activated.json

{  
"id":"ttyyWWxQRv-P0WXUYXphzg",
"subscription":"ttyyWWxQRv-P0WXUYXphzg",
"active":true,
"state":"active",
"changed":1501611720761,
"changedValue":1501611720761,
"changedInSeconds":1501611720,
"changedDisplay":"8/1/17",
"live":false,
"currency":"USD",
"account":{
    "id":"{accountId}",
    "account":"{accountId}",
    "contact":{  
        "first":"Leeroy",
        "last":"Jenkins",
        "email":"ne1@all.com",
        "company":null,
        "phone":null
    },
    "language":"en",
    "country":"US",
    "lookup":{  
        "global":"TVWhu0iwQhKJyuhpT_2yMw"
    },
    "url":"https://furiousfalcon.onfastspring.com/account"
},
"product":{  
    "product":"falcon-monthly-subscriptions",
    "parent":null,
    "display":{  
        "en":"Falcon Monthly Subscription"
    },
    "description":{  
        "summary":{  
            "en":"Lorem ipsum dolor sit amet, consectetuer adipiscing elit."
        },
        "action":{  
            "en":"CLICK TO SUBSCRIBE"
        },
        "full":{  
            "en":"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Pellentesque vel mi quam. Etiam non purus et est volutpat aliquet."
        }
    },
    "image":"https://d8y8nchqlnmka.cloudfront.net/VTetZH1kQD8/DHPIZXJ7Thw/falcon-box_x2.png",
    "sku":"furious10",
    "fulfillments":{  
        "instructions":{  
            "en":"Thank you for subscribing to *Falcon*.  To register, please launch the trial version and select **Help** | **Register Falcon**. Then, copy and paste the license key above into the **License Key** field and click **Submit**."
        },
        "falcon-monthly-subscriptions_license_1":{  
            "fulfillment":"falcon-monthly-subscriptions_license_1",
            "name":"License Generator (Pre-defined List)",
            "applicability":"NON_REBILL_ONLY"
        },
        "falcon-monthly-subscriptions_file_0":{  
            "fulfillment":"falcon-monthly-subscriptions_file_0",
            "name":"File Download (Falcon.exe)",
            "applicability":"NON_REBILL_ONLY"
        }
    },
    "format":"digital",
    "attributes":{  
        "CustomAttribute1":"CustomValue1",
        "CustomAttribute2":"CustomValue2"
    },
    "pricing":{  
        "renew":"auto",
        "interval":"month",
        "intervalLength":1,
        "quantityBehavior":"allow",
        "quantityDefault":1,
        "price":{  
            "USD":14.95
        },
        "dateLimitsEnabled":false,
        "reminderNotification":{  
            "enabled":true,
            "interval":"DAY",
            "intervalLength":1
        },
        "overdueNotification":{  
            "enabled":true,
            "interval":"WEEK",
            "intervalLength":1,
            "amount":2
        },
        "cancellation":{  
            "interval":"WEEK",
            "intervalLength":1
        }
    }
},
"sku":"furious10",
"display":"Falcon Monthly Subscription",
"quantity":1,
"adhoc":false,
"autoRenew":true,
"price":14.95,
"priceDisplay":"$14.95",
"priceInPayoutCurrency":14.95,
"priceInPayoutCurrencyDisplay":"$14.95",
"discount":0.0,
"discountDisplay":"$0.00",
"discountInPayoutCurrency":0.0,
"discountInPayoutCurrencyDisplay":"$0.00",
"subtotal":14.95,
"subtotalDisplay":"$14.95",
"subtotalInPayoutCurrency":14.95,
"subtotalInPayoutCurrencyDisplay":"$14.95",
"attributes":{
    "CustomAttribute1":"CustomValue1",
    "CustomAttribute2":"CustomValue2"
},
"next":1504224000000,
"nextValue":1504224000000,
"nextInSeconds":1504224000,
"nextDisplay":"9/1/17",
"end":1532995200000,
"endValue":1532995200000,
"endInSeconds":1532995200,
"endDisplay":"7/31/18",
"canceledDate":null,
"canceledDateValue":null,
"canceledDateInSeconds":null,
"canceledDateDisplay":null,
"deactivationDate":null,
"deactivationDateValue":null,
"deactivationDateInSeconds":null,
"deactivationDateDisplay":null,
"sequence":1,
"periods":12,
"remainingPeriods":12,
"begin":1501545600000,
"beginValue":1501545600000,
"beginInSeconds":1501545600,
"beginDisplay":"8/1/17",
"intervalUnit":"month",
"intervalLength":1,
"nextChargeCurrency":"USD",
"nextChargeDate":1504224000000,
"nextChargeDateValue":1504224000000,
"nextChargeDateDisplay":"9/1/17",
"nextChargeTotal":14.95,
"nextChargeTotalDisplay":"$14.95",
"nextChargeTotalInPayoutCurrency":14.95,
"nextChargeTotalInPayoutCurrencyDisplay":"$14.95",
"nextNotificationType":"PAYMENT_REMINDER",
"nextNotificationDate":1504137600000,
"nextNotificationDateValue":1504137600000,
"nextNotificationDateInSeconds":1504137600,
"nextNotificationDateDisplay":"8/31/17",
"paymentReminder":{
    "intervalUnit":"day",
    "intervalLength":1
},
"paymentOverdue":{
    "intervalUnit":"week",
    "intervalLength":1,
    "total":2,
    "sent":0
},
"cancellationSetting":{
    "cancellation":"AFTER_LAST_NOTIFICATION",
    "intervalUnit":"week",
    "intervalLength":1
},
"instructions":[  
    {
        "type":"regular",
        "periodStartDate":1532995200000,
        "periodStartDateValue":1532995200000,
        "periodStartDateInSeconds":1532995200,
        "periodStartDateDisplay":"7/31/18",
        "periodEndDate":1532995200000,
        "periodEndDateValue":1532995200000,
        "periodEndDateInSeconds":1532995200,
        "periodEndDateDisplay":"7/31/18",
        "discountPercent":0,
        "discountPercentValue":0,
        "discountPercentDisplay":"0%",
        "discountTotal":0.0,
        "discountTotalDisplay":"$0.00",
        "discountTotalInPayoutCurrency":0.0,
        "discountTotalInPayoutCurrencyDisplay":"$0.00",
        "unitDiscount":0.0,
        "unitDiscountDisplay":"$0.00",
        "unitDiscountInPayoutCurrency":0.0,
        "unitDiscountInPayoutCurrencyDisplay":"$0.00",
        "price":14.95,
        "priceDisplay":"$14.95",
        "priceInPayoutCurrency":14.95,
        "priceInPayoutCurrencyDisplay":"$14.95",
        "priceTotal":14.95,
        "priceTotalDisplay":"$14.95",
        "priceTotalInPayoutCurrency":14.95,
        "priceTotalInPayoutCurrencyDisplay":"$14.95",
        "unitPrice":14.95,
        "unitPriceDisplay":"$14.95",
        "unitPriceInPayoutCurrency":14.95,
        "unitPriceInPayoutCurrencyDisplay":"$14.95",
        "total":14.95,
        "totalDisplay":"$14.95",
        "totalInPayoutCurrency":14.95,
        "totalInPayoutCurrencyDisplay":"$14.95"
    }
]
}