tests/Payloads/subscription_charge_completed.json

{  
"order":{  
    "order":"AxajJf8vQDC_YzEk7QY-7g",
    "id":"AxajJf8vQDC_YzEk7QY-7g",
    "reference":"FUR171013-2389-33111B",
    "buyerReference":null,
    "completed":true,
    "changed":1507929905830,
    "changedValue":1507929905830,
    "changedInSeconds":1507929905,
    "changedDisplay":"10/13/17",
    "language":"en",
    "live":false,
    "currency":"USD",
    "payoutCurrency":"USD",
    "invoiceUrl":"https://furiousfalcon.onfastspring.com/account/order/FUR171013-2389-33111B/invoice",
    "account":"{accountId}",
    "total":149.95,
    "totalDisplay":"$149.95",
    "totalInPayoutCurrency":149.95,
    "totalInPayoutCurrencyDisplay":"$149.95",
    "tax":0.0,
    "taxDisplay":"$0.00",
    "taxInPayoutCurrency":0.0,
    "taxInPayoutCurrencyDisplay":"$0.00",
    "subtotal":149.95,
    "subtotalDisplay":"$149.95",
    "subtotalInPayoutCurrency":149.95,
    "subtotalInPayoutCurrencyDisplay":"$149.95",
    "discount":0.0,
    "discountDisplay":"$0.00",
    "discountInPayoutCurrency":0.0,
    "discountInPayoutCurrencyDisplay":"$0.00",
    "discountWithTax":0.0,
    "discountWithTaxDisplay":"$0.00",
    "discountWithTaxInPayoutCurrency":0.0,
    "discountWithTaxInPayoutCurrencyDisplay":"$0.00",
    "billDescriptor":"FS* fsprg.com",
    "payment":{  
        "type":"test"
    },
    "customer":{  
        "first":"Leeroy",
        "last":"Jenkins II",
        "email":"ne1@all.com",
        "company":"Chicken Danger, Inc.",
        "phone":null
    },
    "address":{  
        "city":"Santa Barbara",
        "regionCode":"CA",
        "regionDisplay":"California",
        "region":"California",
        "postalCode":"93101",
        "country":"US",
        "display":"Santa Barbara, California, 93101, US"
    },
    "notes":[  

    ],
    "items":[  
        {  
            "product":"falcon-monthly-variation",
            "quantity":1,
            "display":"Falcon Monthly Subscription",
            "sku":"furious10",
            "subtotal":149.95,
            "subtotalDisplay":"$149.95",
            "subtotalInPayoutCurrency":149.95,
            "subtotalInPayoutCurrencyDisplay":"$149.95",
            "discount":0.0,
            "discountDisplay":"$0.00",
            "discountInPayoutCurrency":0.0,
            "discountInPayoutCurrencyDisplay":"$0.00",
            "subscription":"5H8bPckiQDSWx9Qx4yqiDw",
            "fulfillments":{  
            "instructions":"<p>Thank you for subscribing to <em>Falcon</em>. To register, please launch the trial version and select <strong>Help</strong> | <strong>Register Falcon</strong>. Then, copy and paste the license key above into the <strong>License Key</strong> field and click <strong>Submit</strong>.</p>"
            }
        }
    ]
},
"currency":"USD",
"total":149.95,
"status":"successful",
"timestamp":1507929902735,
"timestampValue":1507929902735,
"timestampInSeconds":1507929902,
"timestampDisplay":"10/13/17",
"sequence":2,
"periods":null,
"account":{  
    "id":"{accountId}",
    "account":"{accountId}",
    "contact":{  
        "first":"Marcellus",
        "last":"Walrus",
        "email":"ne1@all.com",
        "company":"IndoChina Exports, Inc.",
        "phone":null
    },
    "language":"en",
    "country":"US",
    "lookup":{  
        "global":"TVWhu0iwQhKJyuhpT_2yMw"
    },
    "url":"https://furiousfalcon.onfastspring.com/account"
},
"subscription":{  
    "id":"{subscriptionId}",
    "subscription":"{subscriptionId}",
    "active":true,
    "state":"active",
    "changed":1507762883701,
    "changedValue":1507762883701,
    "changedInSeconds":1507762883,
    "changedDisplay":"10/11/17",
    "live":false,
    "currency":"USD",
    "account":"{accountId}",
    "product":"falcon-monthly-variation",
    "sku":"furious10",
    "display":"Falcon Monthly Subscription",
    "quantity":1,
    "adhoc":false,
    "autoRenew":true,
    "price":149.95,
    "priceDisplay":"$149.95",
    "priceInPayoutCurrency":149.95,
    "priceInPayoutCurrencyDisplay":"$149.95",
    "discount":0.0,
    "discountDisplay":"$0.00",
    "discountInPayoutCurrency":0.0,
    "discountInPayoutCurrencyDisplay":"$0.00",
    "subtotal":149.95,
    "subtotalDisplay":"$149.95",
    "subtotalInPayoutCurrency":149.95,
    "subtotalInPayoutCurrencyDisplay":"$149.95",
    "attributes":{  
        "CustomAttribute1":"CustomValue1",
        "CustomAttribute2":"CustomValue2"
    },
    "next":1523404800000,
    "nextValue":1523404800000,
    "nextInSeconds":1523404800,
    "nextDisplay":"4/11/18",
    "end":null,
    "endValue":null,
    "endInSeconds":null,
    "endDisplay":null,
    "canceledDate":null,
    "canceledDateValue":null,
    "canceledDateInSeconds":null,
    "canceledDateDisplay":null,
    "deactivationDate":null,
    "deactivationDateValue":null,
    "deactivationDateInSeconds":null,
    "deactivationDateDisplay":null,
    "sequence":2,
    "periods":null,
    "remainingPeriods":null,
    "begin":1507680000000,
    "beginValue":1507680000000,
    "beginInSeconds":1507680000,
    "beginDisplay":"10/11/17",
    "intervalUnit":"month",
    "intervalLength":3,
    "nextChargeCurrency":"USD",
    "nextChargeDate":1523404800000,
    "nextChargeDateValue":1523404800000,
    "nextChargeDateDisplay":"4/11/18",
    "nextChargeTotal":149.95,
    "nextChargeTotalDisplay":"$149.95",
    "nextChargeTotalInPayoutCurrency":149.95,
    "nextChargeTotalInPayoutCurrencyDisplay":"$149.95",
    "nextNotificationType":"PAYMENT_REMINDER",
    "nextNotificationDate":1523318400000,
    "nextNotificationDateValue":1523318400000,
    "nextNotificationDateInSeconds":1523318400,
    "nextNotificationDateDisplay":"4/10/18",
    "paymentReminder":{  
        "intervalUnit":"day",
        "intervalLength":1
    },
    "paymentOverdue":{  
        "intervalUnit":"week",
        "intervalLength":1,
        "total":2,
        "sent":0
    },
    "cancellationSetting":{  
        "cancellation":"AFTER_LAST_NOTIFICATION",
        "intervalUnit":"week",
        "intervalLength":1
    },
    "instructions":[  
        {  
            "type":"regular",
            "periodStartDate":null,
            "periodStartDateValue":null,
            "periodStartDateInSeconds":null,
            "periodStartDateDisplay":null,
            "periodEndDate":null,
            "periodEndDateValue":null,
            "periodEndDateInSeconds":null,
            "periodEndDateDisplay":null,
            "discountPercent":0,
            "discountPercentValue":0,
            "discountPercentDisplay":"0%",
            "discountTotal":0.0,
            "discountTotalDisplay":"$0.00",
            "discountTotalInPayoutCurrency":0.0,
            "discountTotalInPayoutCurrencyDisplay":"$0.00",
            "unitDiscount":0.0,
            "unitDiscountDisplay":"$0.00",
            "unitDiscountInPayoutCurrency":0.0,
            "unitDiscountInPayoutCurrencyDisplay":"$0.00",
            "price":149.95,
            "priceDisplay":"$149.95",
            "priceInPayoutCurrency":149.95,
            "priceInPayoutCurrencyDisplay":"$149.95",
            "priceTotal":149.95,
            "priceTotalDisplay":"$149.95",
            "priceTotalInPayoutCurrency":149.95,
            "priceTotalInPayoutCurrencyDisplay":"$149.95",
            "unitPrice":149.95,
            "unitPriceDisplay":"$149.95",
            "unitPriceInPayoutCurrency":149.95,
            "unitPriceInPayoutCurrencyDisplay":"$149.95",
            "total":149.95,
            "totalDisplay":"$149.95",
            "totalInPayoutCurrency":149.95,
            "totalInPayoutCurrencyDisplay":"$149.95"
        }
    ]
}
}